icoLagrangianFoam/tut/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icolagrangianFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT         1e-3;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

libs (
    "libOpenFOAM.so"
    //"libgroovyBC.so"
//    "libsimpleSwakFunctionObjects.so"
//    "libsimpleLagrangianFunctionObjects.so"
//    "libswakLagrangianCloudSourcesFunctionPlugin.so"
//    "libswakFunctionObjects.so"
) ;

