icoLagrangianFoam/tut/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-06; //convert to microeter

vertices
(

       (0  0 -0.5)//0
       (2.5 0 -0.5)//1
       (5 0 -0.5)//2
       (7.5 0 -0.5)//3
       (10 0 -0.5)//4
       (12.5 0 -0.5)//5
       (15 0 -0.5)//6
       (17.5 0 -0.5)//7
       (20 0 -0.5)//8
       (22.5 0 -0.5)//9
       (25 0 -0.5)//10
       (27.5 0 -0.5)//11
       (30 0 -0.5)//12
       (32.5 0 -0.5)//13
       (35 0 -0.5)//15
       (37.5 0 -0.5)//15
       (40 0 -0.5)//16
       (42.5 0 -0.5)//17
       (45 0 -0.5)//18
       (47.5 0 -0.5)//19
       (50   0 -0.5)//20
 
       (50  10 -0.5)//21
       (47.5 9.5 -0.5)//22
       (45 10 -0.5)//23
       (42.5 9.5 -0.5)//24
       (40 10 -0.5)//25
       (37.5 9.5 -0.5)//26
       (35 10 -0.5)//27
       (32.5 9.5 -0.5)//28
       (30 10 -0.5)//29
       (27.5 9.5 -0.5)//30

       (25 10 -0.5)//31
       (22.5 9.5 -0.5)//32
       (20 10 -0.5)//33
       (17.5 9.5 -0.5)//34
       (15 10 -0.5)//35
       (12.5 9.5 -0.5)//36
       (10 10 -0.5)//37
       (7.5 9.5 -0.5)//38
       (5 10 -0.5)//39
       (2.5 9.5 -0.5)//40
       (0 10 -0.5)//41
       //
       (-2.5 0 -0.5)//42
       (-5 0 -0.5)//43
       (-7.5 0 -0.5)//44
       (-10 0 -0.5)//45
       (-12.5 0 -0.5)//46
       (-15 0 -0.5)//47
       (-17.5 0 -0.5)//48
       (-20 0 -0.5)//49
       (-22.5 0 -0.5)//50
       (-25 0 -0.5)//51
       (-27.5 0 -0.5)//52
       (-30 0 -0.5)//53
       (-32.5 0 -0.5)//54
       (-35 0 -0.5)//55
       (-37.5 0 -0.5)//56
       (-40 0 -0.5)//57
       (-42.5 0 -0.5)//58
       (-45 0 -0.5)//59
       (-47.5 0 -0.5)//60
       (-50   0 -0.5)//61
 
       (-50  10 -0.5)//62
       (-47.5 9.5 -0.5)//63
       (-45 10 -0.5)//64
       (-42.5 9.5 -0.5)//65
       (-40 10 -0.5)//66
       (-37.5 9.5 -0.5)//67
       (-35 10 -0.5)//68
       (-32.5 9.5 -0.5)//69
       (-30 10 -0.5)//70
       (-27.5 9.5 -0.5)//71

       (-25 10 -0.5)//72
       (-22.5 9.5 -0.5)//73
       (-20 10 -0.5)//74
       (-17.5 9.5 -0.5)//75
       (-15 10 -0.5)//76
       (-12.5 9.5 -0.5)//77
       (-10 10 -0.5)//78
       (-7.5 9.5 -0.5)//79
       (-5 10 -0.5)//80
       (-2.5 9.5 -0.5)//81

//back

       (0  0 0.5)//0=82
       (2.5 0 0.5)//1=83
       (5 0 0.5)//2=84
       (7.5 0 0.5)//3=85
       (10 0 0.5)//4=86
       (12.5 0 0.5)//5=87
       (15 0 0.5)//6=88
       (17.5 0 0.5)//7=89
       (20 0 0.5)//8=90
       (22.5 0 0.5)//9=91
       (25 0 0.5)//10=92
       (27.5 0 0.5)//11=93
       (30 0 0.5)//12=94
       (32.5 0 0.5)//13=95
       (35 0 0.5)//15=96
       (37.5 0 0.5)//15=97
       (40 0 0.5)//16=98
       (42.5 0 0.5)//17=99
       (45 0 0.5)//18=100
       (47.5 0 0.5)//19=101
       (50   0 0.5)//20=102
 
       (50  10 0.5)//21=103
       (47.5 9.5 0.5)//22=104
       (45 10 0.5)//23=105
       (42.5 9.5 0.5)//24=106
       (40 10 0.5)//25=107
       (37.5 9.5 0.5)//26=108
       (35 10 0.5)//27=109
       (32.5 9.5 0.5)//28=110
       (30 10 0.5)//29=111
       (27.5 9.5 0.5)//30=112

       (25 10 0.5)//31=113
       (22.5 9.5 0.5)//32=114
       (20 10 0.5)//33=115
       (17.5 9.5 0.5)//34=116
       (15 10 0.5)//35=117
       (12.5 9.5 0.5)//36=118
       (10 10 0.5)//37=119
       (7.5 9.5 0.5)//38=120
       (5 10 0.5)//39=121
       (2.5 9.5 0.5)//40=122
       (0 10 0.5)//41=123
//
       (-2.5 0 0.5)//42=124
       (-5  0  0.5)//43=125
       (-7.5 0 0.5)//44=126
       (-10 0 0.5)//45=127
       (-12.5 0 0.5)//46=128
       (-15 0 0.5)//47=129
       (-17.5 0 0.5)//48=130
       (-20 0 0.5)//49=131
       (-22.5 0 0.5)//50=132
       (-25 0 0.5)//51=133
       (-27.5 0 0.5)//52=134
       (-30 0 0.5)//53=135
       (-32.5 0 0.5)//54=136
       (-35 0 0.5)//55=137
       (-37.5 0 0.5)//56=138
       (-40 0 0.5)//57=139
       (-42.5 0 0.5)//58=140
       (-45 0 0.5)//59=141
       (-47.5 0 0.5)//60=142
       (-50   0 0.5)//61=143
 
       (-50  10  0.5)//62=144
       (-47.5 9.5  0.5)//63=145
       (-45 10  0.5)//64=146
       (-42.5 9.5  0.5)//65=147
       (-40 10  0.5)//66=148
       (-37.5 9.5  0.5)//67=149
       (-35 10  0.5)//68=150
       (-32.5 9.5 0.5)//69=151
       (-30 10  0.5)//70=152
       (-27.5 9.5 0.5)//71=153

       (-25 10 0.5)//72=154
       (-22.5 9.5 0.5)//73=155
       (-20 10 0.5)//74=156
       (-17.5 9.5 0.5)//75=157
       (-15 10 0.5)//76=158
       (-12.5 9.5 0.5)//77=159
       (-10 10 0.5)//78=160
       (-7.5 9.5 0.5)//79=161
       (-5 10 0.5)//80=162
       (-2.5 9.5 0.5)//81=163

);

blocks
(
   hex (0 1 40 41 82 83 122 123) (2 10 1)   simpleGrading (1 1 1)
   hex (1 2 39 40 83 84 121 122) (2 10 1)  simpleGrading (1 1 1)
   hex (2 3 38 39 84 85 120 121) (2 10 1)  simpleGrading (1 1 1)

   hex (3 4 37 38 85 86 119 120) (2 10 1)   simpleGrading (1 1 1)
   hex (4 5 36 37 86 87 118 119) (2 10 1)   simpleGrading (1 1 1)
   hex (5 6 35 36 87 88 117 118 ) (2 10 1) simpleGrading (1 1 1)
   hex (6 7 34 35 88 89 116 117 ) (2 10 1)  simpleGrading (1 1 1)

   hex (7 8 33 34 89 90 115 116) (2 10 1)    simpleGrading (1 1 1)
   hex (8 9 32 33 90 91 114 115) (2 10 1)    simpleGrading (1 1 1)
   hex (9 10 31 32 91 92 113 114) (2 10 1)   simpleGrading (1 1 1)
   hex (10 11 30 31 92 93 112 113) (2 10 1)  simpleGrading (1 1 1)
   hex (11 12 29 30 93 94 111 112) (2 10 1) simpleGrading (1 1 1)
   hex (12 13 28 29 94 95 110 111) (2 10 1)  simpleGrading (1 1 1)

   hex (13 14 27 28 95 96 109 110) (2 10 1) simpleGrading (1 1 1)
   hex (14 15 26 27 96 97 108 109) (2 10 1) simpleGrading (1 1 1)
   hex (15 16 25 26 97 98 107 108) (2 10 1) simpleGrading (1 1 1)
   hex (16 17 24 25 98 99 106 107) (2 10 1) simpleGrading (1 1 1)

   hex (17 18 23 24 99 100 105 106) (2 10 1) simpleGrading (1 1 1)
   hex (18 19 22 23 100 101 104 105) (2 10 1) simpleGrading (1 1 1)
   hex (19 20 21 22 101 102 103 104) (2 10 1) simpleGrading (1 1 1)
//
   hex  (42 0 41 81 124 82 123 163)  (2 10 1)  simpleGrading (1 1 1)
   hex (43 42 81 80 125 124 163 162) (2 10 1)  simpleGrading (1 1 1)
   hex (44 43 80 79 126 125 162 161) (2 10 1)  simpleGrading (1 1 1)

   hex (45 44 79 78 127 126 161 160) (2 10 1)  simpleGrading (1 1 1)
   hex (46 45 78 77 128 127 160 159) (2 10 1)  simpleGrading (1 1 1)
   hex (47 46 77 76 129 128 159 158 ) (2 10 1) simpleGrading (1 1 1)
   hex (48 47 76 75 130 129 158 157 ) (2 10 1) simpleGrading (1 1 1)

   hex (49 48 75 74 131 130 157 156) (2 10 1)  simpleGrading (1 1 1)
   hex (50 49 74 73 132 131 156 155) (2 10 1)  simpleGrading (1 1 1)
   hex (51 50 73 72 133 132 155 154) (2 10 1)  simpleGrading (1 1 1)
   hex (52 51 72 71 134 133 154 153) (2 10 1)  simpleGrading (1 1 1)
   hex (53 52 71 70 135 134 153 152) (2 10 1)  simpleGrading (1 1 1)
   hex (54 53 70 69 136 135 152 151) (2 10 1)  simpleGrading (1 1 1)

   hex (55 54 69 68 137 136 151 150) (2 10 1)  simpleGrading (1 1 1)
   hex (56 55 68 67 138 137 150 149) (2 10 1)  simpleGrading (1 1 1)
   hex (57 56 67 66 139 138 149 148) (2 10 1)  simpleGrading (1 1 1)
   hex (58 57 66 65 140 139 148 147) (2 10 1)  simpleGrading (1 1 1)

   hex (59 58 65 64 141 140 147 146) (2 10 1)  simpleGrading (1 1 1)
   hex (60 59 64 63 142 141 146 145) (2 10 1)  simpleGrading (1 1 1)
   hex (61 60 63 62 143 142 145 144) (2 10 1)  simpleGrading (1 1 1)  
);

patches
(

    wall fixedWalls
    (
      (21 22 104 103)
      (22 23 105 104)
      (23 24 106 105)
      (24 25 107 106)
      (25 26 108 107)
      (26 27 109 108)
      (27 28 110 109)
      (28 29 111 110)//
      (29 30 112 111)
      (30 31 113 112)
      (31 32 114 113)
      (32 33 115 114)
      (33 34 116 115)
      (34 35 117 116)
      (35 36 118 117)
      (36 37 119 118)//
       
      (37 38 120 119)
      (38 39 121 120)
      (39 40 122 121)
      (40 41 123 122)/////

      (41 81 163 123)
      (81 80 162 163)
      (80 79 161 162)
      (79 78 160 161)
      (78 77 159 160)
      (77 76 158 159)
      (76 75 157 158)
      (75 74 156 157)//
      (74 73 155 156)
      (73 72 154 155)
      (72 71 153 154)
      (71 70 152 153)
      (70 69 151 152)
      (69 68 150 151)
      (68 67 149 150)
      (67 66 148 149)   
      (66 65 147 148)
      (65 64 146 147)
      (64 63 145 146)
      
      (63 62 144 145)// it was named inlet ?
    ) 

   
    patch in
    ( 
      (62 61 143 144)
    
    )
    patch out
    (
        (20 21 103 102)
        
    )
    empty frontAndBack
    (
//front
     (0 1 40 41)
     (1 2 39 40)
     (2 3 38 39)

    (3 4 37 38)
    (4 5 36 37)
    (5 6 35 36)
    (6 7 34 35)

    (7 8 33 34)
    (8 9 32 33)
    
    (9 10 31 32)
    (10 11 30 31)
    (11 12 29 30)
    (12 13 28 29)

    (13 14 27 28)
    (14 15 26 27)
    (15 16 25 26)
    (16 17 24 25)

    (17 18 23 24)
    (18 19 22 23)
    (19 20 21 22)
//
    (42 0 41 81)
    (43 42 81 80)
    (44 43 80 79)

    (45 44 79 78)
    (46 45 78 77)
    (47 46 77 76)
    (48 47 76 75)

    (49 48 75 74)
    (50 49 74 73)
    (51 50 73 72)
   
    (52 51 72 71)
    (53 52 71 70)
    (54 53 70 69)

    (55 54 69 68)
    (56 55 68 67)
    (57 56 67 66)
    (58 57 66 65)

    (59 58 65 64)
    (60 59 64 63)
    (61 60 63 62)  
       
//back
  
    (82 83 122 123) 
    (83 84 121 122)
    (84 85 120 121)

    (85 86 119 120) 
    (86 87 118 119)
    (87 88 117 118)
    (88 89 116 117)

    (89 90 115 116) 
    (90 91 114 115)
    (91 92 113 114)
    (92 93 112 113)
    (93 94 111 112)
    (94 95 110 111)

    (95 96 109 110)
    (96 97 108 109)
    (97 98 107 108)
    (98 99 106 107)

    (99 100 105 106)
    (100 101 104 105)
    (101 102 103 104)
//
    (124 82 123 163) 
    (125 124 163 162)
    (126 125 162 161)

   (127 126 161 160)
   (128 127 160 159)
   (129 128 159 158)
   (130 129 158 157)

    (131 130 157 156)
    (132 131 156 155)
    (133 132 155 154)
    (134 133 154 153)
    (135 134 153 152)
    (136 135 152 151)

    (137 136 151 150)
   (138 137 150 149)
   (139 138 149 148)
   (140 139 148 147)

  (141 140 147 146)
  (142 141 146 145)
  (143 142 145 144)  
    )

);

mergePatchPairs
(
);

// ************************************************************************* //
