icoLagrangianFoam/tut/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel   Newtonian; 

nu              nu [0 2 -1 0 0 0 0] 1.48e-05;

rho             rho [1 -3 0 0 0 0 0] 1.2;

kpp		kpp  [0 2 0 0 0 0 0] 1E-14;

alphaMax  alphaMax  [0 0 0 0 0 0 0] 0.9;

nPMax        500;

filterPatch   fixedWalls;

// ************************************************************************* //
